{
  "blogs": [
    {
      "title": "Нужен ли сон программисту?",
      "body": "Могу уместить все в одно предложение, и просто сказать, что сон нужен каждому человеку, но объясняет ли это почему именно в то время когда тебя ни кто не трогает, нужно спать? Ведь можно просто поспать днём.. У каждого человека есть свои биологические часы, и у каждого они настроены по-разному, ведь кто-то ложиться спать в 10 вечера, а кто-то в 5 утра. И каждый человек высыпается по разному, кто-то за 4 часа, а кто-то и за 8 часов будет сонный, в такой ситуации нужно понять сколько вам нужно часов сна, что-бы целый день бодрствовать. После того как вы узнали или уже примерно понимаете за какое количество времени вы можете выспаться, нужно составить план сна, но опять-же вопрос, а зачем мне это? Попробую ответить коротко, т.к вы сидите за ПК до утра, а после целый день спите, вы сбиваете себе режим который так необходим для стабильной функции мозга, в результате мозговая активность падает, у вас падает иммунитет, к слову ничего хорошего. Да, я и сам грешу этим, но я стараюсь держать планку и не сидеть до 5-ти утра втыкая в монитор, а после в 7 утра вставать, и идти в школу. Поэтому я предлагаю альтернативу, если для здорового сна вам необходима допустим 7-9 часов, попробуйте ложиться в 11 вечера, а ближе к 6-7 часам вставать, именно вставать на ноги а не выключить будильник и дальше спать, умойтесь, выпейте воды, и начните заниматься своими делами, если не филонить и делать это на протяжении 21-го дня, я вас уверяю, на 22 день вы уже даже не задумываясь будете ложиться в 10-12 часов вечера, а просыпаться утром и продуктивно работать над своими проектами. Важно подметить что перед сном минимум за час, постарайтесь не использовать телефон или компьютер, да это сложно, очень сложно, но если не смотреть на экран перед сном, ваш организм не начнёт думать что на улице день, тем самым не начнёт внушая мозгу что нельзя спать, и нудно бодрствовать. На этом можно делать вывод что сон для программиста очень важен, даже больше чем для обычного человека, так что хороших вам снов, и продуктивной работы!",
      "author": "Серафим",
      "id": 1
    },
    {
      "title": "Сладкая ли жизнь программиста?",
      "body": "Привет, т.к я веб программист,  я буду в основном говорить про web it, в каждой сфере есть свои тонкости и причуды. Начнём с того кто такие программисты? Могу сказать с точностью что человек который начал изучать программирование понял, или поймёт для себя одну важную вещь, у программистов практически нет личной жизни, не берём в счёт 'программистов' которые изучают один язык больше двух лет, и не дойдя до ООП, если таковое имеется в языке, ну не суть. Уверяю вас вы не будете зарабатывать миллионы как говорят на разных курсах, и мастер классах, просто поймите, чтобы заработать эти миллионы нужно отдать всю свою жизнь программированию, и то, не факт что у вас всё выйдет, ведь все зависит от разных факторов, не подумайте что я хочу вас заставить думать что программирование это уныло, программирование это как смысл жизни, в какой-то момент ты понимаешь что всю свою жизнь ты будешь писать этот долбаный код в 3 часа ночи, и не понимать почему не работает той или иной фрагмент на сайте, в этом и смысл программирования, преодолевать трудности которые появляются на пути к успеху, ведь без трудностей в жизни, нельзя точно сказать, счастлив ли ты? Но это уже другая тема, если не углубляться в вопрос, то можно сказать что программисты это те наркоманы которые радуются новой дозе когда их код начинает работать, потому что  они так долго его писали и мучались над ним, если вы не знали то пенсия у программистов лет в 40, ведь какой человек не устанет писать код каждый божий день находясь в офисе сидя в кресле. Но почему все о плохом? Есть и плюсы, во-первых если же вы будете много знать (по меркам настоящего времени) то вы и вправду будете много зарабатывать, даже джуниор в Украине зарабатывает 750$ на 2019 год, не говорю про мидлов, и сеньоров, так-же если вы любите свою работу, то она будет вам приносить в двойне больше, может быть я что-то упускаю из виду, но кому какая разница? Нужно уметь слушать только себя, для программиста это хороший скилл, особенно если вы решите работать на фрилансе, возможно следующая статья будет именно про фриланс. Помни, 'нет завтра - есть сегодня, нет настроения - есть цель'.",
      "author": "Серафим",
      "id": 2
    },
    {
      "title": "Моя історія як програміста",
      "body": "Мій перший досвід роботи з комп’ютером був у 7 років. Це був старенький комп'ютер, але мені й його вистачало. Я дуже полюбляв малювати у paint та цікавився файловою системою. Через рік у сім'ю завітав, на той час крутезний, ноутбук вже з windows 7. Я був дуже здивований, бо раніше й не уявляв такого чудового дизайну новенької ос. Матуся займалася редагуванням фото у Photoshop і я постійно дивився як вона виконує обробку, як перетворює сумні не дуже цікаві фото, но колоритні шедеври. Пізніше я й сам 'переліз' з пєінту до фотошопа, саме це дозволило мені розвивати творчі здібності та навички у програмі. Наступним був фантастичний ультрабук, який навіть до сьогодні використовується батьками. Мені він відрив магію відеомонтажу, завдяки потужному процесору core i7 я мав змогу знімати власні відео на телефон та редагувати їх на ноуті. А також я поглибився у системному адмініструванні, для мене було улюбленим зайняттям побудова локальних мереж та налаштування пристроїв для взаємодії один з іншим. Таким чином можна було зберігати файли на вінчестері та друкувати документи з будь-якої точки дома, хоча принтер навіть не мав wifi. А також нарешті відкрив для себе програмування. Моєю першою мовою був pascal, мені були до вподоби задачі з складними математичними формулами. Навіть перший мій проект був написан саме на pascal - це було відтворення мобільної ігри Doodle Jump. І напевно найцікавіші часи були, коли мені подарували власний комп'ютер, який у свою чергу ні в чому мене не обмежував, завдяки ньому я познайомився з 3д програмами: робив власні ігри, моделі, анімації. Та ще й вивчив нову мову С#. Далі я вирішив почати відвідувати курси, які у свою чергу дали мені базу знань та досвід у web. А далі досвід роботи з замовником. З плином років я перепробував багато різних мов, але найбільш мене вразила та сподобалася - мова JavaScript. Я вирішив зв'язати з цією справою все своє життя. Зараз же я тримаю напрям у вивчені особливостей мови JS та фрєймворків. А також дивлюся у майбутнє та планує зайнятися вивченням Node JS. Ось таким чином я ненавмисно ще у дитинстві вирішив ким хочу стати, хоча спочатку мене цікавила робота інженера 😊",
      "author": "Ник",
      "id": 3
    },
    {
      "title": "Festival letter",
      "body": "Hi Martin, Why didn't you write to me for so long? Hope you passed the entrance exams, didn't you? In this email I gonna tell you about my holidays, it was fantastic! My Mum suggested me to try something new, we decided to go to the Endangered Animals Festival together. There was a wide variety of animals that I have never even seen. Of course, there were not the animals themselves, but their puppets. Special thanks to our guide, he is a good man. I learnt lots of interesting facts about these endangered animals. For example, do you know that in China, for killing a panda the death penalty provided? It was amazing, really sad that you have not been able to arrive. Tell me about your days, what did you do? See you next time, Nick.",
      "author": "Ник",
      "id": 4
    }
  ]
}